[Information]
; (Latest Translator, First Translator, Second Translator ...)
TRANSLATOR=Ngô Tấn Phát (RezaxOnes - Nhánh Studios), Nguyễn Đức Dũng, Trần Nhật Sang
VERSION=5.5.0

[Language]
LANGUAGE=Việt Nam
CHARACTER_CODE=Unicode (UTF-16, LE, w/ BOM)
LOCALE_ID=0x042A

[Url]
WIKIPEDIA_SMART=https://en.wikipedia.org/wiki/Self-Monitoring,_Analysis_and_Reporting_Technology

[Menu]
FILE=Tập tin (&F)
CUSTOMIZE=Tùy chỉnh (&C)
EXIT=Thoát (&E)
EDIT=&Chỉnh sửa
COPY=&Sao chép
FUNCTION=Chức năng
HIDE_SMART_INFO=&Ẩn thông tin S.M.A.R.T
HIDE_SERIAL_NUMBER=Ẩn số Sê-ri (Serial Number)
SHOW_DRIVE_LETTER=Hiện ký tự của ổ đĩa
ADVANCED_DISK_SEARCH=Dò tìm ổ đĩa chuyên sâu
EVENT_LOG=&Nhật ký các sự kiện
AAM_APM_CONTROL=Điều khiển AAM APM
AUTO_AAM_APM_ADAPTION=Tự động điều chỉnh AAM APM
RESIDENT=Chạy nền
STARTUP=Khởi động cùng với Windows
OPEN_DISK_MANAGEMENT=&Mở trình quản lí ổ đĩa
OPEN_DEVICE_MANAGER=Mở trình quản lí thiết bị
ADVANCED_FEATURE=Chức năng mở rộng
REFRESH=&Làm mới lại
RESCAN=Dò tìm lại
DISABLE=&Vô hiệu hoá (Tắt)
AUTO_REFRESH=&Khoảng thời gian tự động làm mới
AUTO_REFRESH_TARGET=Tự động làm mới
AUTO_REFRESH_TARGET_ALL_DISK=Tự động làm mới tất cả ổ đĩa được chọn
AUTO_REFRESH_UNTARGET_ALL_DISK=Tự động làm mới tất cả ổ đĩa không được chọn
WAIT_TIME_AT_STARTUP=&Thời gian chờ khởi động
GRAPH=&Biểu đồ
THEME=&Giao diện
DISK=&Ổ đĩa
HELP=&Trợ giúp
HELP_WEB=&Trang web trợ giúp [Web]
HELP_ABOUT=&Về CrystalDiskInfo
HELP_ABOUT_SMART=Về S.M.A.R.T (Wikipedia) [Web]
LANGUAGE=&Ngôn ngữ
ITEM=&Mục
TEMPERATURE_TYPE=Định dạng nhiệt độ
CELSIUS=Celsius (°C)
FAHRENHEIT=Fahrenheit (°F)
HEALTH_STATUS_SETTING=&Cài đặt trạng thái sức khoẻ ổ đĩa

;Graph
OPTION=&Tuỳ chọn
LEGEND_POSITION=&Vị trí chú giải
NORTH_WEST=&Tây Bắc
NORTH_EAST=Đông Bắc
SOUTH_WEST=Tây Nam
SOUTH_EAST=&Đông Nam
MAX_PLOT_POINT=&Số các điểm trên biểu đồ tối đa
TIME_FORMAT=&Định dạng thời gian
PAINT_WEEKEND=Vẽ biểu đồ cuối tuần
ALL=&Tất cả

;2.7.0
COPY_OPTION=Tuỳ chọn sao chép
RESIDENT_STYLE=Kiểu chạy nền
MINIMIZE=Thu nhỏ
HIDE=Ẩn

;3.0.0
ZOOM=&Thu phóng cửa sổ
AUTO=&Tự động
ATTRIBUTE=&Thuộc tính

;3.5.0
ASCII_VIEW=Xem kiểu ASCII
AUTO_DTECTION=Tự động phát hiện
SECOND=giây
MINUTE=phút
HOUR=giờ

:3.9.4
WORKAROUND=Workaround (Giải pháp tạm thời)

;4.0.0
ALERT_MAIL=Email cảnh báo
MAIL_SETTINGS=Cài đặt email
SMART_IN_ENGLISH=S.M.A.R.T. bằng tiếng Anh
FONT_SETTING=Cài đặt phông chữ

;5.0.0
ALERT_FEATURES=Tính năng cảnh báo
ALARM_HISTORY=Lịch sử cảnh báo
ALERT_SOUND=Âm thanh cảnh báo
SOUND_SETTINGS=Cài đặt âm thanh
GADGET_SUPPORT=Hỗ trợ Gadget (tiện ích)
INSTALL_GADGET=Cài đặt Gadget (tiện ích)
ENABLE_AUTO=Bật (Tự động phát hiện)
ENABLE_ALL=Bật (Tất cả ổ đĩa)
ENABLE_RAID=Bật (Chỉ RAID Volume)

;6.0.0
HIDE_NO_SMART_DISK=&Ẩn ổ đĩa không có S.M.A.R.T.
GREEN_MODE=&Chế độ xanh lá cây

;8.6.0
SAVE_TEXT=Lưu (&văn bản)
SAVE_IMAGE=&Lưu (hình ảnh)

;9.0.0
DRIVE_SORT_METHOD=Cách sắp xếp ổ đĩa
PHYSICAL_DRIVE_ID=ID của ổ đĩa vật lý
DRIVE_LETTER=Ký tự ổ đĩa
DRIVE_MENU_NUMBER=Hiển thị số lượng ổ đĩa

;9.2.0
VOICE=Giọng nói

;9.3.0
STARTUP_VOICE=Giọng nói khởi động

;9.5.0
HIDE_RAID_VOLUME=Ẩn ổ đĩa &RAID
[TrayMenu]
EXIT=Thoát
REFRESH=Làm mới
RESCAN=Dò lại
ENABLE=Cho phép (Bật)
DISABLE=Không cho phép (Tắt)
ENABLE_ALL=Cho phép tất cả (Bật tất cả)
DISABLE_ALL=Không cho phép tất cả (Tắt tất cả)
AUTO_REFRESH=Khoảng thời gian tự động làm mới
AUTO_REFRESH_01_MIN=1 phút
AUTO_REFRESH_03_MIN=3 phút
AUTO_REFRESH_05_MIN=5 phút
AUTO_REFRESH_10_MIN=10 phút
AUTO_REFRESH_30_MIN=30 phút
AUTO_REFRESH_60_MIN=60 phút
AUTO_REFRESH_TARGET=Tự động làm mới
AUTO_REFRESH_TARGET_ALL_DISK=Tự động làm mới tất cả ổ đĩa được chọn
AUTO_REFRESH_UNTARGET_ALL_DISK=Tự động làm mới tất cả ổ đĩa không được chọn
ALARM_SETTING_TEMPERATURE=Cài đặt cảnh báo nhiệt độ
ALARM_SETTING_HEALTH_STATUS=Cài đặt cảnh báo sức khoẻ ổ đĩa
SHOW_MAIN_WINDOW=Hiển thị cửa sổ chính
SHOW_TEMPERATURE_ICON=Hiển thị biểu tượng nhiệt độ
SHOW_ALL_TEMPERATURE_ICON= Hiển thị tất cả biểu tượng nhiệt độ
HIDE_ALL_TEMPERATURE_ICON= Ẩn tất cả biểu tượng nhiệt độ
COLLECTIVE_SETTING= Cài đặt chung
GRAPH=Biểu đồ
;Added 3.0
SHOW_TEMPERATURE_ICON_ONLY=Chỉ hiển thị biểu tượng nhiệt độ

[DiskStatus]
GOOD=Tốt
CAUTION=Cảnh báo
BAD=Xấu (Không ổn)
UNKNOW=Không xác định
DISK=Ổ đĩa

[Dialog]
LIST_ID=ID
LIST_CURRENT=Danh sách hiện tại
LIST_WORST=Danh sách xấu
LIST_THRESHOLD=Danh sách tới ngưỡng
LIST_RAW_VALUES=Danh sách giá trị Raw (Thô)
LIST_DESCRIPTION=Danh sách miêu tả
LIST_ATTRIBUTE_NAME=Danh sách tên thuộc tính

FIRMWARE=Firmware
SERIAL_NUMBER=Số Sê-ri
INTERFACE=Chuẩn giao tiếp (Interface)
STANDARD=Tiêu chuẩn
TRANSFER_MODE=Chế độ truyền dữ liệu
BUFFER_SIZE=Dung lượng bộ nhớ đệm
NV_CACHE_SIZE=Dung lượng bộ nhớ đệm NV
ROTATION_RATE=Tốc độ quay
TEMPERATURE=Nhiệt độ
POWER_ON_HOURS=Tổng thời gian hoạt động
POWER_ON_COUNT=Số lần khởi động
DRIVE_LETTER=Ký tự ổ đĩa
FEATURE=Tính năng
HEALTH_STATUS=Trạng thái sức khỏe

UNKNOWN=Không xác định
POWER_ON_COUNT_UNIT=lần
POWER_ON_HOURS_UNIT=giờ
POWER_ON_DAYS_UNIT=ngày
POWER_ON_YEARS_UNIT=năm

;4.3
TOTAL_HOST_WRITES=Tổng lượng ghi của HOST
TOTAL_HOST_READS=Tổng lượng đọc của HOST
TOTAL_NAND_WRITES=Tổng lượng ghi vào NAND

;4.5
WEAR_LEVELING_COUNT=Mức độ hao mòn (tính theo số lần ghi/xóa trung bình trên từng cell NAND)

;6.1
CURRENT_MODE_SUPPORTED_MODE=Chế độ hiện tại | Chế độ tối đa được hỗ trợ
MAJOR_VERSION_MINOR_VERSION=Phiên bản chính | Phiên bản phụ

;8.5.0
FONT_FACE=Font Face
FONT_SCALE=Font Scale (%)
DEFAULT=Mặc định
OK=Đồng ý

;8.9.0
ENABLED=Đã kích hoạt (bật)
DISABLED=Đã vô hiệu hóa (tắt)

[Message]
DETECT_UNIT_POWER_ON_HOURS=Xác định số giờ chạy
DETECT_DISK=Xác định ổ đĩa
PLEASE_ENABLE_WMI=Vui lòng cho phép WMI(Windows Management Instrumentation)
PLEASE_RESTART_THIS_APPLICATION=Vui lòng khởi động lại chương trình
DISK_NOT_FOUND=Không tìm thấy ổ đĩa

[Alarm]
ALARM_TEMPERATURE=Alarm - Nhiệt độ
ALARM_HEALTH_STATUS=Alarm - Sức khỏe
DEGRADATION=Đang xấu đi
RECOVERY=Phục hồi
;3.5.0
INFO_HEALTH_STATUS=Thông tin - Trạng thái sức khỏe

[Graph]
PLEASE_SELECT_ITEM=Vui lòng chọn thiết bị
ACTUAL_VALUE=Giá trị thực
NORMALIZED_VALUE=Giá trị đã chuẩn hóa
ALL_ON=Tất cả bật
ALL_OFF=Tất cả tắt
RESET=Khởi động lại

[Customize]
LINE_COLOR=Màu dòng
BACKGROUND_IMAGE=Ảnh nền
SUPPORTED_IMAGE_FORMAT=Hỗ trợ định dạng ảnh
ALL_FILES=Tất cả tập tin

;5.0.0
SUPPORTED_SOUND_FORMAT=Hỗ trợ định dạng âm thanh

[AamApm]
AAM_LOW=<- Thấp (80h)
AAM_HIGH=Cao (FEh) ->
AAM_RECOMMEND=Khuyên dùng
APM_LOW=<- Thấp (01h)
APM_HIGH=Cao (FEh) ->
;3.5.0
AUTOMATIC_ACOUSTIC_MANAGEMENT=Quản lý tiếng ồn tự động (AAM)
ADVANCED_POWER_MANAGEMENT=Quản lý điện năng nâng cao (APM)

[WindowTitle]
ABOUT=Giới thiệu về CrystalDiskInfo
GRAPH=Biểu đồ
CUSTOMIZE=Tùy chỉnh
VERSION_INFORMATION=Thông tin phiên bản
AAM_APM_CONTROL=Điều khiển AAM/APM
HEALTH_STATUS_SETTING=Cài đặt trạng thái sức khỏe

;5.0.0
ALARM_HISTORY=Lịch sử cảnh báo
SOUND_SETTINGS=Cài đặt âm thanh

;5.1.0
FONT_SETTING=Cài đặt phông chữ

[HealthStatus]
THRESHOLD_OF_CAUTION=Ngưỡng cảnh báo
APPLY=Áp dụng
DEFAULT=Tiêu chuẩn

[Smart]
UNKNOWN=Không xác định
VENDOR_SPECIFIC=Thuộc tính đặc biệt của nhà sản xuất
01=Tỷ lệ đọc lỗi dữ liệu
02=Hiệu năng đọc và ghi
03=Thời gian khởi động đĩa (đến tốc độ quay ổn định mà nhà sản xuất quy định)
04=Số lần khởi động và dừng của ổ đĩa
05=Số lượng sectors bị remap (thay thế)
06=Biên độ tín hiệu đọc
07=Tỷ lệ lỗi khi đầu đọc tìm kiếm dữ liệu
08=Hiệu năng tìm kiếm dữ liệu của đầu đọc
09=Tổng thời gian hoạt động
0A=Số lần thử khởi động lại của trục quay
0B=Số lần hiệu chỉnh lại đầu đọc
0C=Số lần bật và tắt nguồn
0D=Tỷ lệ lỗi đọc ở mức nhẹ stb
B8=Lỗi Đầu - Cuối (Do ổ đĩa phát hiện có sai lệch dữ liệu giữa ổ đĩa và ram)
BB=Số lượng các lỗi không thể sửa
BC=Lệnh quá thời gian chờ
BD=Lệch độ cao đầu ghi
BE=Nhiệt độ luồng khí
BF=Tỷ lệ lỗi do rung lắc
C0=Số lần thu lại đầu đọc hoặc ghi khi tắt nguồn
C1=Số chu kỳ nạp hoặc rút đầu đọc
C2=Nhiệt độ
C3=Lỗi phần cứng nhưng ECC đã sửa
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C5=Số lượng sector hiện tại đang chờ xử lý
C6=Số sector không thể sửa
C7=Số lượng lỗi do dữ liệu của cáp truyền dữ liệu ổ đĩa đến bo mạch chủ bị sai lệch thông tin,...
C8=Tỷ lệ lỗi ghi
C9=Tỷ lệ lỗi đọc ở mức nhẹ
CA=Lỗi đánh dấu địa chỉ dữ liệu
CB=Ổ đĩa cố gắng sửa lỗi nhưng thất bại 
CC=Lỗi nhẹ được thuật toán ECC phát hiện và sửa lại thành công
CD=Số lần đầu đọc bị vấp phải bụi bẩn hoặc vết gồ trên đĩa làm nó bị nóng lên đột ngột
CE=Độ cao của đầu đọc
CF=Dòng điện mà ổ đĩa cần để kéo ổ đĩa đạt được tốc độ lý tưởng
D0=Số lần trục quay bị kẹt
D1=Hiệu suất tìm dữ liệu khi đang nghỉ (sleep) của ổ đĩa
D3=Số lần bị rung lắc mạnh mà ổ cứng phát hiện trong quá trình ghi dữ liệu
D4=Số lần bị sốc mà ổ cứng phát hiện trong quá trình ghi dữ liệu
DC=Độ lệch của trục đĩa
DD=Tỷ lệ lỗi do rung lắc
DE=Số giờ đầu đọc hoạt động
DF=Ổ đĩa thử lại thất bại khi cố gắng xuất phát sau đó quay lại nơi ban đầu khi khởi động
E0=Độ ma sát trong quá trình quay (có thể là do ma sát quá cao)
E1=Số chu kỳ nạp hoặc rút đầu đọc
E2=Tốc độ nhảy số của ổ đĩa khi được cấp nguồn (ảnh hưởng đến khả năng boot vào OS)
E3=Số lần trục quay phải tăng lực mô-men xoắn để trục quay có đủ đà để quay
E4=Chu kỳ ổ cứng thu lại đầu đọc do mất nguồn
E6=Độ sắc nét và chất lượng của dữ liệu mà đầu đọc thu được
E7=Nhiệt độ
F0=Thời gian đầu đọc hoạt động
FA=Tỉ lệ thử lại của đầu đọc khi gặp lỗi đọc
FE=Số lần bạn làm rơi ổ đĩa nhưng được bảo vệ thành công

;Updated 5.4.0
F1=Total Host Writes
F2=Total Host Reads

;Updated 9.5.0
17=Helium Condition Lower
18=Helium Condition Upper
1B=MAMR Health Monitor

[SmartSsd]
01=Read Error Rate
02=Throughput Performance
03=Spin-Up Time
04=Start/Stop Count
05=Số lượng sectors bị remap (thay thế)
06=Biên độ tín hiệu đọc
07=Tỷ lệ lỗi khi đầu đọc tìm kiếm dữ liệu
08=Hiệu năng tìm kiếm dữ liệu của đầu đọc
09=Tổng thời gian hoạt động
0A=Số lần thử khởi động lại của trục quay
0B=Số lần hiệu chỉnh lại đầu đọc
0C=Số lần bật và tắt nguồn
0D=Tỷ lệ lỗi đọc ở mức nhẹ stb
C0=Số lần bị tắt máy đột ngột
C2=Nhiệt độ
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C5=Số lượng sector hiện tại đang chờ xử lý
C6=Số sector không thể sửa
; CrystalDiskInfo assign
FF=Remaining Life

;Updated 5.4.0
F1=Total Host Writes
F2=Total Host Reads

[SmartMtron]
BB=Total Erase Count

[SmartIndilinx]
01=Read Error Rate
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
B8=Initial Bad Block Count
C3=Program Failure Block Count
C4=Erase Failure Block Count
C5=Read Failure Block Count
C6=Total Count of Read Sectors
C7=Total Count of Write Sectors
C8=Total Count of Read Commands
C9=Total Count of Write Commands
CA=Total Count of Error bits from flash
CB=Total Count of Read Sectors with Correctable Bit Errors
CC=Bad Block Full Flag
CD=Maximum PE Count Specification
CE=Minimum Erase Count
CF=Maximum Erase Count
D0=Average Erase Count
D1=Remaining Drive Life

[SmartJMicron60x]
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
C2=Nhiệt độ
E5=Halt System ID, Flash ID
E8=Firmware Version Information
E9=ECC Fail Record
EA=Average Erase Count, Max Erase Count
EB=Good Block Count, System Block Count

[SmartIntel]
03=Spin Up Time
04=Start/Stop Count
05=Re-Allocated Sector Count
09=Tổng thời gian hoạt động Count
0C=Số lần bật và tắt nguồn
C0=Số lần bị tắt máy đột ngột
E1=Host Writes
E8=Available Reserved Space
E9=Media Wearout Indicator
B8=End to End Error Detection Count

;Updated 4.1
AA=Available Reserved Space
AB=Program Fail Count
AC=Erase Fail Count
BB=Uncorrectable Error Count

;Updated 4.3
AE=Unexpected Power Loss
E2=Timed Workload Media Wear
E3=Timed Workload Host Read/Write Ratio
E4=Timed Workload Timer
F1=Total LBAs Written
F2=Total LBAs Read
F9=Total NAND Writes

;Updated 5.5.0
B7=SATA Downshift Count
BE=Nhiệt độ
C7=CRC Error Count

;Updated 5.6.1
AF=Power Loss Protection Failure
C2=Nhiệt độ
C5=Pending Sector Count

;Added 6.6.0
EA=Thermal Throttle Status

[SmartSamsung]
05=Reallocated Sector Count
09=Tổng thời gian hoạt động
0C=Power-on Count
AF=Program Fail Count (Chip)
B0=Erase Fail Count (Chip)
B1=Wear Leveling Count
B2=Used Reserved Block Count (Chip)
B3=Used Reserved Block Count (Total)
B4=Unused Reserved Block Count (Total)
B5=Program Fail Count (Total)
B6=Erase Fail Count (Total)
B7=Runtime Bad Block (Total)
BB=Uncorrectable Error Count
BE=Nhiệt độ luồng khí
C2=Nhiệt độ
C3=Tỉ lệ các lỗi đã được ECC sửa
C6=Off-Line Uncorrectable Error Count
C7=CRC Error Count
C9=Super cap Status
CA=SSD Mode Status
EB=POR Recovery Count
F1=Total LBA Written
F2=Total LBA Read

;Added 6.6
AA=Unused Reserved Block Count (Chip) 
AB=Program Fail Count (Chip)
AC=Erase Fail Count (Chip)
AD=Wear Leveling Count
AE=Unexpected Power Loss Count
B8=Error Detection
E9=Normalized Media Wear-out

[SmartSandForce] ;Updated (3.7)
01=Raw Read Error Rate
05=Retired Block Count
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
0D=Tỷ lệ lỗi đọc ở mức nhẹ
64=Gigabytes Erased
AA=Reserve Block Count
AB=Program Fail Count
AC=Erase Fail Count
AE=Unexpected Power Loss Count
B1=Wear Range Delta
B5=Program Fail Count
B6=Erase Fail Count
B8=Reported I/O Error Detection Code Errors
BB=Số lượng các lỗi không thể sửa
C2=Nhiệt độ
C3=On-the-Fly ECC Uncorrectable Error Count
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C6=Số sector không thể sửa
C7=SATA R-Errors (CRC) Error Count
C9=Uncorrectable Tỷ lệ lỗi đọc ở mức nhẹ
CC=Lỗi nhẹ được thuật toán ECC phát hiện và sửa lại thành công Rate
E6=Life Curve Status
E7=SSD Life Left
E8=Available Reserved Space
EB=SuperCap health
F1=Lifetime Writes from Host
F2=Lifetime Reads from Host

[SmartJMicron61x] ;Added (3.9)
01=Read Error Rate
02=Throughput Performance
03=Spin-Up Time
05=Số lượng sectors bị remap (thay thế)
07=Tỷ lệ lỗi khi đầu đọc tìm kiếm dữ liệu
08=Hiệu năng tìm kiếm dữ liệu của đầu đọc
09=Tổng thời gian hoạt động
0A=Số lần thử khởi động lại của trục quay
0C=Số lần bật và tắt nguồn
A8=SATA PHY Error Count
AF=Bad Cluster Table Count (ECC Fail Count)
C0=Unexpected Power Loss Count
C2=Nhiệt độ
C5=Số lượng sector hiện tại đang chờ xử lý
AA=Bad Block Count
AD=Erase Count

[SmartMicron] ;Added 4.0.0/ Updated 6.6.0
; RAIN = Redundant Array of Independent NAND
01=Raw Read Error Rate
05=Reallocated NAND Blocks
09=Power On Hours
0C=Số lần bật và tắt nguồn
0D=Soft Error Rate
0E=Device Capacity (NAND)
0F=User Capacity
10=Spare Blocks Available
11=Remaining Spare Blocks
64=Total Erase Count
AA=Reserved Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Block-Erase Count
AE=Unexpected Power Loss Count
B4=Unused Reserve NAND Blocks
B5=Unaligned Access Count
B7=SATA Interface Downshift
B8=Error Correction Count
BB=Số lượng các lỗi không thể sửa
BC=Command Timeout Count
BD=Factory Bad Block Count
C2=Nhiệt độ
C3=Cumulative ECC Bit Correction Count
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C5=Số lượng sector hiện tại đang chờ xử lý
C6=Smart Off-line Scan Uncorrectable Error Count
C7=Ultra DMA CRC Error Rate
CA=Percent Lifetime Used
CE=Tỷ lệ lỗi ghi
D2=Successful RAIN Recovery Count
EA=Total Bytes Read
F2=Write Protect Progress
F3=ECC Bits Corrected
F4=ECC Cumulative Threshold Events
F5=Cumulative Program NAND Pages
F6=Total Host Sector Writes
F7=Host Program Page Count
F8=Background Program Page Count

[SmartMicronMU02] ;Updated 6.6.0
; RAIN = Redundant Array of Independent NAND
01=Raw Read Error Rate
05=Số lượng sectors bị remap (thay thế)
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
0D=Soft Error Rate
0E=Device Capacity (NAND)
0F=User Capacity
10=Spare Blocks Available
11=Remaining Spare Blocks
64=Total Erase Count
AA=Reserved Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Block-Erase Count
AE=Unexpected Power Loss Count
B4=Unused Reserve NAND Blocks
B7=SATA Interface Downshift
B8=Error Correction Count
BB=Số lượng các lỗi không thể sửa
BC=Command Timeout Count
BD=Factory Bad Block Count
C2=Nhiệt độ
C3=Cumulative ECC Bit Correction Count
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C5=Số lượng sector hiện tại đang chờ xử lý
C6=Smart Off-line Scan Uncorrectable Error Count
C7=Ultra DMA CRC Error Rate
CA=Percent Lifetime Used
CE=Tỷ lệ lỗi ghi
D2=Successful RAIN Recovery Count
EA=Total Bytes Read
F3=ECC Bits Corrected
F4=ECC Cumulative Threshold Events
F5=Cumulative Program NAND Pages
F6=Total Host Sector Writes
F7=Host Program Page Count
F8=Background Program Page Count

; Updated 6.6.0
A0=Số sector không thể sửa
A1=Valid Spare Blocks
A3=Initial Invalid Blocks
94=Total SLC Erase Count
95=Maximum SLC Erase Count
96=Minimum SLC Erase Count
97=Average SLC Erase Count
A4=Total TLC Erase Count
A5=Maximum TLC Erase Count
A6=Minimum TLC Erase Count
A7=Average TLC Erase Count
A9=Percentage Lifetime Remaining
B5=Program Fail Count
B6=Erase Fail Count
C0=Số lần thu lại đầu đọc hoặc ghi khi tắt nguồn
E8=Available Reserved Space
F1=Total LBA Write
F2=Total LBA Read
F5=Total TLC Write Count
F6=Total SLC Write Count
F7=RAID Recovery Count

[SmartOcz] ;Added (4.5)
01=Raw Read Error Rate
03=Spin Up Time
04=Start Stop Count
05=Số lượng sectors bị remap (thay thế)
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
E8=Total Count of Write Sectors
E9=Remaining Life

; Added 6.6.0
64=Total Blocks Erased
A7=SSD Protect Mode
A8=SATA PHY Error Count
A9=Bad Block Count
AD=Erase Count
B8=Factory Bad Block Count
C0=Unexpected Power Loss Count
CA=Total Number of Corrected Bits
CD=Max Rated PE Counts
CE=Minimum Erase Counts
CF=Maximum Erase Counts
D3=SATA Uncorrectable Error Count
D4=NAND Page Reads During Retry
D5=Simple Read Retry Attempts
D6=Adaptive Read Retry Attempts
DD=Internal Data Path Uncorrectable Errors
DE=RAID Recovery Count
E6=Power Loss Protection
FB=NAND Read Count

;Updated 6.7.0
F1=Total Host Writes
F2=Total Host Reads

[SmartPlextor] ;Added (5.1.0)/Updated (5.4.0)
01=Read Error Rate
05=Số lượng sectors bị remap (thay thế)
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
AA=Grown Bad Blocks
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Program/Erase Count
AE=Unexpected Power Loss Count
AF=Program Fail Count (Worst Case)
B0=Erase Fail Count (Worst Case)
B1=Wear Leveling Count
B2=Used Reserved Block Count (Worst Case)
B3=Used Reserved Block Count
B4=UnUsed Reserved Block Count (Total)
B5=Program Fail Count
B6=Erase Fail Count
B7=SATA Interface Down Shift
B8=End-to-End Data Errors Corrected
BB=Uncorrectable Error Count
BC=Command Time out
C0=Số lần bị tắt máy đột ngột
C3=ECC rate
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C6=Số sector không thể sửa
C7=Ultra CRC Error Count
E8=Available Reserved Space
E9=NAND GB written
F1=Total Host Writes
F2=Total Host Reads

[SmartSanDisk] ;Added (5.2.0)
05=Retired Block Count
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
AA=Reserve Block Count
AB=Program Fail Count
AC=Erase Fail Count
AE=Unexpected Power Loss Count
BB=Số lượng các lỗi không thể sửa
E8=Remaining Life
F1=Total Host Writes
F2=Total Host Reads

[SmartOczVector] ;Added (5.3.0)
05=Accumulated Runtime Bad Blocks
09=Tổng thời gian hoạt động Count
0C=Số lần bật và tắt nguồn
AB=Available Over-Provisioned Block Count
AE=Số lần bật và tắt nguồn (Unplanned)
BB=Total Uncorrectable NAND Reads
C3=Total Programming Failures
C4=Total Erase Failures
C5=Total Read Failures (Uncorrectable)
C6=Host Reads
C7=Host Writes
D0=Average Erase Count
D2=SATA CRC Error Count
E9=Remaining Life
F9=Total NAND Programming Count

;Updated 5.5.0
F1=Total Host Writes
F2=Total Host Reads

;Updated 6.6.0
64=Total Blocks Erased
B8=Factory Bad Block Count Total
CA=Total Number Of Read Bits Corrected
CD=Max Rated PE Count
CE=Min Erase Count
CF=Max Erase Count
D4=Total Count NAND Pages Reads Requiring Read Retry
D5=Total Count of Simple Read Retry Attempts
D6=Total Count of Adaptive Read Retry Attempts
DD=Internal Data Path Protection Uncorrectable Errors
DE=RAID Recovery Count
E0=In Warranty
E1=DAS Polarity
E2=Partial Pfail
E6=Write Throttling Activation Flag
F9=Total NAND Programming Count (pages)
FB=Total NAND Read Count

[SmartCorsair] ;Added 6.2.0
01=Raw Read Error Rate
05=Retired Block Count
09=Power On Hours
0C=Số lần bật và tắt nguồn
AA=Reserve Block Count
AC=Erase Fail Count
AE=Unexpected Power Loss Count
B5=Program Fail Count
BB=Số lượng các lỗi không thể sửa
C2=Nhiệt độ
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
E7=SSD Life Left
F1=Lifetime GB Written
F2=Lifetime GB Read

[SmartToshiba] ;Added 6.2.0
01=Read Error Rate
02=Throughput Performance
03=Spin-Up Time
04=Start/Stop Count
05=Số lượng sectors bị remap (thay thế)
07=Tỷ lệ lỗi khi đầu đọc tìm kiếm dữ liệu
08=Hiệu năng tìm kiếm dữ liệu của đầu đọc
09=Tổng thời gian hoạt động
0A=Số lần thử khởi động lại của trục quay
0B=Số lần hiệu chỉnh lại đầu đọc
0C=Số lần bật và tắt nguồn
A7=SSD Protect Mode
A8=SATA PHY Error Count
A9=Total Bad Block Count
AD=Erase Count
C0=Unexpected Power Loss Count
C2=Nhiệt độ
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C5=Số lượng sector hiện tại đang chờ xử lý
C6=Số sector không thể sửa
F1=Total Host Writes
F2=Total Host Reads

[SmartSanDiskGb] ;Added 6.2.0
05=Reallocated Block Count
09=Power On Hours
0C=Số lần bật và tắt nguồn
A6=Min W/E Cycle
A7=Max Bad Block/Die
A8=Maximum Erase Cycle
A9=Total Bad Block
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Erase Cycle
AE=Unexpected Power Loss Count
BB=Số lượng các lỗi không thể sửa
C2=Nhiệt độ
D4=SATA PHY Error
E6=Percentage Total P/E Count
E8=Spare Block Remaining
E9=Total GB Written To NAND
F1=Total GB Written
F2=Total GB Read

[SmartKingston] ;Added 6.6.0
01=Read Error Rate
02=Throughput Performance
03=Spin Up Time
05=Số lượng sectors bị remap (thay thế)
07=Tỷ lệ lỗi khi đầu đọc tìm kiếm dữ liệu
08=Hiệu năng tìm kiếm dữ liệu của đầu đọc
09=Tổng thời gian hoạt động
0A=Số lần thử khởi động lại của trục quay
0C=Số lần bật và tắt nguồn
A8=SATA PHY Error Count
AA=Bad Block Count
AD=Erase count
AF=Bad Cluster Table Count
BB=Uncorrectable Errors
C0=Số lần bị tắt máy đột ngột
C2=Nhiệt độ
C4=Later Bad Block Count
C5=Số lượng sector hiện tại đang chờ xử lý
C7=CRC Error Count
DA=CRC Error Count
E7=SSD Life Left
E9=Lifetime Writes to Flash
F0=Write Head
F1=Host Writes
F2=Host Reads
F4=Average Erase Count
F5=Max Erase Count
F6=Total Erase Count

[SmartNVMe] ;Added 9.7.0
01=Critical Warning
02=Composite Nhiệt độ
03=Available Spare
04=Available Spare Threshold
05=Percentage Used
06=Data Units Read
07=Data Units Written
08=Host Read Commands
09=Host Write Commands
0A=Controller Busy Time
0B=Power Cycles
0C=Power On Hours
0D=Unsafe Shutdowns
0E=Media and Data Integrity Errors
0F=Number of Error Information Log Entries
10=Warning Composite Temperature Time
11=Critical Composite Temperature Time
12=Temperature Sensor 1
13=Temperature Sensor 2
14=Temperature Sensor 3
15=Temperature Sensor 4
16=Temperature Sensor 5
17=Temperature Sensor 6
18=Temperature Sensor 7
19=Temperature Sensor 8
1A=Thermal Management Temperature 1 Transition Count
1B=Thermal Management Temperature 2 Transition Count
1C=Total Time For Thermal Management Temperature 1
1D=Total Time For Thermal Management Temperature 2

[SmartRealtek] ;Added by Realtek
01=Raw data error rate
05=Reallocated sector count
09=Power on hour count
0C=Số lần bật và tắt nguồn
A1=GDN
A2=Total erase count
A3=Max PE cycle
A4=Average erase count
A5=Initial bad block count
A6=Total bad block count
A7=SSD protect mode
A8=SATA Phy error count
A9=Health
AB=Program fail count
AC=Erase fail count
AE=Unexpected power loss count
AF=ECC fail count
B5=Unaligned access count
BB=Reported uncorrectable error
C2=Enclosure temperature
C3=Cumulative corrected ecc
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C7=Ultra DMA CRC error count
CE=Min. erase count
CF=Max erase count
E7=Lifetime left
E8=Available reserved space
F1=Write life time
F2=Read life time
F9=Total GB written to NAND (TLC)
FA=Total GB written to NAND (SLC)

[SmartSKhynix] ; Updated 8.8.0
01=Read Error Rate
05=Re-Assigned Sector Count
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
64=Total Erase Count
A8=Min. Erase Count
A9=Max. Erase Count
AA=Reserve Block Count
AB=Program Fail Count
AC=Erase Fail Count
AE=Unexpected Power Loss Count
AF=Program Fail Count(Worst Case)
B0=Erase Fail Count(Worst Case)
B1=Wear Leveling Count
B2=Used Reseved Block Count(Worst Case)
B3=Used Reseved Block Count(SSD Total)
B4=UnUsed Reseved Block Count(SSD Total)
B5=Program Fail Count(SSD Total)
B6=Erase Fail Count(SSD Total)
B7=SATA Downshift Count
B8=Lỗi Đầu - Cuối (Do ổ đĩa phát hiện có sai lệch dữ liệu giữa ổ đĩa và ram) Detection Count
BB=Uncorrectable Error Count
BC=Command Timeout Count
BF=Op Shock Event Count
C2=Nhiệt độ
C3=ECC Rate
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C6=Số sector không thể sửa
C7=CRC Error Count
C9=Uncorrectable Tỷ lệ lỗi đọc ở mức nhẹ
CC=Lỗi nhẹ được thuật toán ECC phát hiện và sửa lại thành công Rate
D4=Phy Error Count
E7=SSD Life Left
E9=SSD Life Left
EA=NAND Written
F1=Total LBA Written
F2=Total LBA Read
FA=Total Number of NAND Read Retries

[SmartKioxia]
09=Tổng thời gian hoạt động Count
0C=Device Số lần bật và tắt nguồn
A7=SSD Protect Mode
A8=SATA PHY Error Count
A9=Bad Block Count
AD=Erase Count (User Data)
C0=Unexpected Power Loss Count
C2=Nhiệt độ
F1=Host Writes

[SmartWdc]
01=Read Error Rate
05=Reassigned Block Count
09=Power On Hours
0C=Số lần bật và tắt nguồn
A5=Block Erase Count (SLC)
A6=Minimum P/E Cycles
A7=Maximum Bad Blocks per die
A8=Maximum P/E Cycles
A9=Total Bad Block
AA=Grown Bad Blocks
AB=Program Fail Count
AC=Erase Fail Count
AD=Average P/E Cycles
AE=Unexpected Power Loss Count
B8=Lỗi Đầu - Cuối (Do ổ đĩa phát hiện có sai lệch dữ liệu giữa ổ đĩa và ram) Detection/Correction Count
BB=Số lượng các lỗi không thể sửa
BC=Command Timeout Count
C2=Nhiệt độ
C7=CRC Error Count
D4=SATA PHY Error
E6=Media Wearout Indicator
E8=Available Reserve Space
E9=NAND GB Written
EA=NAND GB Written (SLC)
EE=Media Wearout Indicator (Cycles Remaining)
F1=Total GB Written
F2=Total GB Read
F4=Nhiệt độ Throttle Status
F9=NAND GB Written

[SmartKingstonSuv]
01=Read Error Rate
05=Reallocated Sector Count
09=Power On Hours
0C=Số lần bật và tắt nguồn
AA=Used Reserved Block Count
AB=Program Fail Count
AC=Erase Fail Count
AE=Unexpected Power Off Count
AF=Program Fail Count Worst Die
B0=Erase Fail Count Worst Die
B1=Wear Leveling Count
B2=Used Reserved Block Count worst Die
B4=Unused Reserved Block Count (SSD Total)
BB=Số lượng các lỗi không thể sửa
C2=Nhiệt độ
C3=On-the-Fly ECC Error Count
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C5=Pending Sector Count
C7=UDMA CRC Error Count
C9=Uncorrectable Read Error Rate
CC=Lỗi nhẹ được thuật toán ECC phát hiện và sửa lại thành công Rate
E7=SSD Life Left
EA=Lifetime Nand Writes
F1=Lifetime Host Writes
F2=Lifetime Host Reads
FA=Total Number of NAND Read Retries

[SmartKingstonKC600]
01=Read Error Rate
05=Re-Allocated NAND Block Count
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
94=Reserved
95=Reserved
96=Reserved
97=SLC Average Erase Count
9F=DRAM 1 bit Error Count
A0=Reported UECC (UnCorrectable) Errors
A1=Available Reserved Space
A4=Reserved
A5=Reserved
A6=Reserved
A7=Average Erase Count
A8=Reserved
A9=Percentage Of Rated Lifetime Remaining
B1=Reserved
B5=Program Fail Count
B6=Erase Fail Count
C0=Unexpected Power Loss Count
C2=Device Nhiệt độ
C3=Lỗi phần cứng nhưng ECC đã sửa
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C7=UDMA CRC Error Count
E7=Percentage of Rated Lifetime Remaining
E8=Unused Reserved Block Count
F1=Total LBAs Written
F2=Total LBAs Read
F5=Total Media Writes

[SmartKingstonDC500]
01=Host UNC Error Count
09=Power on Hours
0C=Power On / Off Cycle
A7=Protect mode
A8=SATA PHY Error Count
A9=Bad Block Rate
AA=Bad Block Information
AC=Erase Failure Count
AD=Erase Count
B5=Program Fail Count
B6=Erase Failure Count
BB=Host UNC Error Count
C0=Unexpected Power Loss Count
C2=Nhiệt độ
C4=Total Later Bad Block Count
C7=CRC Error Count
CF=Thermal Throttling Count
DA=CRC Error Count
E7=SSD Life Remaining
E8=Read Fail Count
E9=NAND Write
F1=Host Write
F2=Host Read
F4=Avg Erase Count
F5=Max Erase Count
F6=Total Erase Count

[SmartKingstonSA400]
01=Uncorrectable Errors
09=Power On Hours
0C=Power Cycles
94=Vendor Unique
95=Vendor Unique
A7=Vendor Unique
A8=SATA PHY Error Count
A9=Vendor Unique
AA=Bad Block Count
AC=Vendor Unique
AD=Erase Count
B5=Vendor Unique
B6=Vendor Unique
BB=Uncorrectable ECC Errors
C2=Nhiệt độ
C4=Reallocation Events
C7=SATA CRC Error
DA=CRC Error Count
E7=SSD Wear Indicator
E9=Lifetime Nand Writes
F1=Lifetime Writes from Host
F2=Lifetime Read from Host
F4=Average Erase Count
F5=Max Erase Count
F6=Total Erase Count

[SmartSsstc]
01=Raw Read Error Rate
05=Reallocated Block Count
09=Power On Hours
0C=Số lần bật và tắt nguồn
AA=Available Reserved Space
AB=Program Fail Count(Total)
AC=Erase Fail Count(Total)
AD=Average Program/Erase Count
AE=Unexpected Power Loss Count
AF=Program Fail count (Worst case)
B0=Erase Fail Count (Worst case)
B1=Wear Leveling Count
B2=Used Reserved Block Count (Worst case)
B3=Used Reserved Block Count (Total)
B4=Unused Reserved Block Count (Total)
B7=SATA Interface Down shift
B8=End-to-End Data Errors Count
BB=Uncorrectable Error Count
BC=Command Time out
C2=Drive Nhiệt độ
C3=ECC rate
C6=OffLine Uncorrectable Error Count
C7=SATA CRC Error Count
E5=Power Loss Protection Failure
E7=Percentage Lifetime Remaining
E8=Available Reserved Space 
E9=NAND GB Written
F1=Total Host Write
F2=Total Host Read 
F3=NAND GB Written

[SmartIntelDc]
01=Raw Read Error Count
05=Reallocated Flash Block Count
09=Tổng thời gian hoạt động Count
0C=Số lần bật và tắt nguồn
0E=Device Capacity
0F=User Capacity
10=Spare Blocks Available
11=Remaining Spare Available
AC=Total Block Erase Failure
AD=Per Block Max Erase Count
AE=Unexpected Power Loss Count
AF=Average Erase Count
B0=Power Loss Protection Error
B5=Total Block Program Failure
B8=Lỗi Đầu - Cuối (Do ổ đĩa phát hiện có sai lệch dữ liệu giữa ổ đĩa và ram) Detection Count
BB=Uncorrectable Error Count
C2=Nhiệt độ
C5=Pending Sector Count
C6=Offline Uncorrectable Error Count
C7=CRC Error Count
CA=Percentage of Drive Life Used
E2=Timed Workload - Media Wear
E3=Timed Workload - Host Read/Write Ratio
E4=Timed Workload Timer
EA=Total Host Bytes Read
EB=Total Host Bytes/Sectors Written
F1=Total Nand Bytes/Sectors Written

[SmartApacer]
09=Power on Hours
0C=Số lần bật và tắt nguồn
A3=Maximum Erase Count
A4=Average Erase Count
A6=Total Later Bad Block Count
A7=SSD Protect Mode
A8=SATA PHY Error Count
AB=Program Fail Count
AC=Erase Fail Count
AF=Bad Cluster Table Count
C0=Unexpected Power Loss Count
C2=Nhiệt độ
E7=Lifetime Left
F1=Total Sectors Write

[SmartSiliconMotion]
01=Read Error Rate
05=Số lượng sectors bị remap (thay thế)
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn
94=SLC Total Erase Count
95=SLC Maximum Erase Count
96=SLC Minimum Erase Count
97=SLC Average Erase Count
9F=DRAM 1 bit Error Count
A0=Uncorrectable sectors count when read/write
A1=Number of Valid Spare Blocks
A2=Number of Cache Data Block
A3=Number of Initial Invalid Blocks
A4=Total Erase Count
A5=Maximum Erase Count
A6=Minimum Erase Count
A7=Average Erase Count
A8=Max Erase Count of Spec
A9=Remain Life
AF=Program fail count in worst die
B0=Erase fail count in worst die
B1=Total Wear Level Count
B2=Runtime Invalid Block Count
B5=Total Program Fail Count
B6=Total Erase Fail Count
BB=Uncorrectable Error Count
C0=Số lần thu lại đầu đọc hoặc ghi khi tắt nguồn
C2=Nhiệt độ
C3=Lỗi phần cứng nhưng ECC đã sửa
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C5=Số lượng sector hiện tại đang chờ xử lý
C6=Uncorrectable Error Count Off-line
C7=Ultra DMA CRC Error Count
E8=Available Reserved Space
F1=Total LBA Written
F2=Total LBA Read
F5=Flash Write Sector Count

[SmartJMicron66x]
01=Read Error Rate
02=Throughput Performance
03=Spin-Up Time
05=Số lượng sectors bị remap (thay thế)
07=Tỷ lệ lỗi khi đầu đọc tìm kiếm dữ liệu
08=Hiệu năng tìm kiếm dữ liệu của đầu đọc
09=Tổng thời gian hoạt động
0A=Số lần thử khởi động lại của trục quay
0C=Số lần bật và tắt nguồn
A8=SATA PHY Error Count
AA=Bad Block Count
AD=Erase Count
AF=Bad Cluster Table Count
B4=Spare Block Count
C0=Unexpected Power Loss Count
C2=Nhiệt độ
C5=Số lượng sector hiện tại đang chờ xử lý
E7=Drive Life
E9=Write Sector Count (NAND)
F0=Write Head
F1=Total LBA Written
F2=Total LBA Read

[SmartPhison]
01=Read Error Rate
09=Power on Hours
0C=Số lần bật và tắt nguồn
A8=SATA PHY Error Count
AA=Bad Block Count
AD=Erase Count
C0=Unexpected Power Loss Count
C2=Nhiệt độ
DA=Number of CRC Error
E7=SSD Life Left
F1=Host Writes

[SmartSeagate]
01=Read Error Rate
05=Retired Sectors Count
09=Power On Hours
0C=Số lần bật và tắt nguồn
10=Spare Blocks Available
11=Remaining Spare Blocks
A8=SATA PHY Error Count
AA=Bad Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Erase Count
AE=Unexpected Power Loss Count
B1=Wear Range Delta
B5=Program Fail Count
B6=Erase Fail Count
C0=Unexpected Power loss Count
C2=Nhiệt độ
C9=Soft Error Rate
CC=Lỗi nhẹ được thuật toán ECC phát hiện và sửa lại thành công Rate
DA=CRC Error Count
E7=SSD Life Left
E8=Read Failure Block Count
E9=NAND GiB Written
EA=Lifetime Writes To Flash
EB=NAND sectors Written
F1=Lifetime Writes From Host
F2=Lifetime Reads From Host
FA=Lifetime NAND Read Retries

[SmartSeagateIronWolf]
01=Raw Read Error Rate
05=Reallocated Sector Count
09=Power On Hours
0C=Số lần bật và tắt nguồn
64=Flash Gigabytes Erased
66=Lifetime PS4 Entry Count
67=Lifetime PS3 Entry Count
AA=Grown Bad Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Program/Erase Count
AE=Unexpected Power Loss Count
B1=Wear Range Delta
B7=SATA/PCIe Interface Downshift Count
BB=Uncorrectable ECC Count
C2=Nhiệt độ
C3=RAISE ECC Correctable Count
C6=Uncorrectable Read Error Count
C7=SATA R-Error (CRC) Error Count
E6=Drive Life Protection Status
E7=SSD Life Left
E8=Available Reserved Space
E9=Lifetime Writes to Flash
F1=Lifetime Writes From Host
F2=Lifetime Reads From Host
F3=Free Space

[SmartMarvell] ; Added 8.8.3
05=Number of New Bad Block
09=Power On Hours
0C=Số lần bật và tắt nguồn
A4=Total Erase Count
A5=Maximum Erase Count
A6=Minimum Erase Count
A7=Average Erase Count
C0=Power off Retract Count
C2=Nhiệt độ
C7=SATA CRC Error Count
F1=Total Written
F2=Total Read

[SmartMaxiotek] ; Added 8.8.6
05=Reallocated Sector Count
09=Tổng thời gian hoạt động
0C=Drive Số lần bật và tắt nguồn
A7=SSD Protect Mode
A8=PHY Error Count
A9=Bad Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Erase Count
AF=Bad Cluster Table Count
B1=Read Retry Count
B4=Spare Block Count Left
BB=Reported UNC Errors
C0=Unexpected Power Loss Count
C2=Nhiệt độ
C4=Reallocated Event Count
C7=UDMA CRC Error Count
CE=Minimum Erase Count
CF=Maximum Erase Count
D0=Average Erase Count
D1=Minimum Erase Count of SLC block
D2=Maximum Erase Count of SLC block
D3=Average Erase Count of SLC block
E7=SSD Life Left
E9=Write Counts Sectors to Nand
EA=Read Counts Sectors from Nand
F1=Write Sector Count
F2=Read Sector Count
F5=Bit Error Count

[SmartSeagateBarraCuda] ; Added 8.9.0
01=UECC Error Count
05=Retired Sectors Count
09=Power On Hours
0C=Số lần bật và tắt nguồn
10=Spare Blocks Available
11=Remaining Spare Blocks
A8=SATA PHY Error Count
AA=Bad Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Erase Count
AE=Unexpected Power Loss Count
B1=Wear Range Delta
B5=Program Fail Count
B6=Erase Fail Count
C0=Unexpected Power loss Count
C2=Nhiệt độ
C9=Soft Error Rate
CC=Lỗi nhẹ được thuật toán ECC phát hiện và sửa lại thành công Rate
DA=CRC Error Count
E7=SSD Life Left
E8=Read Failure Block Count
E9=NAND GiB Written
EA=Lifetime Writes To Flash
EB=NAND sectors Written
F1=Lifetime Writes From Host
F2=Lifetime Reads From Host
FA=Lifetime NAND Read Retries

[SmartYmtc] ; Added 8.10.0
05=New Bad Block Count
09=Tổng thời gian hoạt động Count
0C=Số lần bật và tắt nguồn
AA=Max Bad Block Count
A8=SATA PHY Error Count
A9=Bad Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Erase Count
AF=Bad Cluster Count
B7=SATA Interface Downshift
B8=End to End Error Detection/Correction Count
BB=Uncorrectable Error Count
BE=Nhiệt độ
C0=Unexpected Power Loss Count
C4=Re-allocated Event Count
C7=CRC Error Count
CE=Minimum Erase Count
CF=Maximum Erase Count
D0=Average Erase Count
D1=SLC Minimum Erase Count
D2=SLC Maximum Erase Count
D3=SLC Average Erase Count
E7=SSD Life Left
E9=Write sector count to NAND
EA=Read sector count to NAND
F1=Total LBA written
F2=Total LBA Read
F3=NAND Nhiệt độ
F5=Bit Error Count

[SmartScy] ;Added 8.12.8
01=Raw Read Error Rate
05=Reallocated Sector Count
07=Tỷ lệ lỗi khi đầu đọc tìm kiếm dữ liệu
09=Tổng thời gian hoạt động
0C=Drive Số lần bật và tắt nguồn
A7=Average Erase Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Erase Count
B1=Read Retry Count
B4=Spare Block Count Left
B7=Runtime Bad Block
BB=Reported UNC Errors
C0=Unexpected Power Loss Count
C2=Controlled Nhiệt độ
C3=Cumulative ECC Bit Correction Count
C4=Reallocated Event Count
C5=Current Pending Sector
C7=UDMA CRC Error Count
E7=SSD Life Left
F1=Total LBAs Written
F2=Total LBAs Read
F5=Total Nand Flash Written

[SmartRecadata] ;Added 8.14.0
07=Tỷ lệ lỗi khi đầu đọc tìm kiếm dữ liệu
09=Tổng thời gian hoạt động
0C=Drive Số lần bật và tắt nguồn
A7=Average erase count
AB=Program Fail Count
AC=Erase Fail Count
AD=Erase Count
B1=Read Retry Count
B4=Spare Block Count Left
B7=Runtime Bad Block
BB=Reported UNC Errors
C0=Unexpected Power Loss Count
C2=Controlled Nhiệt độ
C3=Cumulative ECC Bit Correction Count
C4=Reallocated Event Count
C5=Current Pending Sector
C7=UDMA CRC Error Count
E7=SSD Life Left
F1=Total LBAs written
F2=Total LBAs read
F5=Total Nand Flash Written

[SmartSanDiskHp] ;Added 8.17.0
01=Raw Read Error Rate
05=Reassigned Block Count
09=Power On Hours
0C=Drive Số lần bật và tắt nguồn
AA=Reserved Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Wear Leveling Count
AE=Unexpected Power Loss Count
B0=Unused Reserved Block Count
B7=SATA Interface Downshift Count
B8=End to End Error Detection/Correction Count
BB=Uncorrectable Error Count
BC=Command Time Out
BE=Nhiệt độ luồng khí
C2=Nhiệt độ
C4=Reallocated Event Count
C7=CRC Error Count
C9=SSD Life Left
E6=Media Wearout Indicator
F1=Total LBAs Written
F2=Total LBAs Read
F3=Throttle Statistics
F4=Nhiệt độ Throttle Status
F9=TLC NAND GB Writes

[SmartSanDiskHpVenus] ;Added 8.17.0
01=Raw Read Error Rate
05=Reassigned Block Count
09=Power On Hours
0C=Drive Số lần bật và tắt nguồn
AA=Reserved Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Wear Leveling Count
AE=Unexpected Power Loss Count
B0=Unused Reserved Block Count
B7=SATA Interface Downshift Count
B8=End to End Error Detection/Correction Count
BB=Uncorrectable Error Count
BC=Command Time Out
BE=Nhiệt độ luồng khí
C2=Nhiệt độ
C4=Reallocated Event Count
C7=CRC Error Count
C9=SSD Life Left
E6=Media Wearout Indicator
F1=Total LBAs Written
F2=Total LBAs Read
F3=Total NAND Writes
F4=Nhiệt độ Throttle Status
F9=TLC NAND GB Writes

[SmartSanDiskDell] ;Added 8.17.0
05=Reassigned Block Count
09=Power On Hours
0C=Drive Số lần bật và tắt nguồn
AF=Program Fail Count (Worst Case Component)
B0=Erase Fail Count (Worst Case Component)
B1=Wear Leveling Count
B2=Used Reserved Block Count (Worst Case Component)
B3=Used Reserved Block Count (SSD Total)
B4=Remaining Reserved Block Count (SSD Total)
B5=Program Fail Count (SSD Total)
B6=Erase Fail Count (SSD Total)
BB=Uncorrectable Error Count
C2=Nhiệt độ
C3=ECC Rate
C7=CRC Error Count
E6=Media Wearout Indicator
EE=Media Wearout Indicator (Cycles Remaining)
F1=Total LBAs Written
F2=Total LBAs Read

[SmartSanDiskLenovo] ;Added 8.17.0
05=Reassigned Block Count
09=Power On Hours
0C=Drive Số lần bật và tắt nguồn
A6=Minimum P/E Cycles
A7=Maximum Bad Blocks per Die
A8=Maximum P/E cycles
A9=Total Bad Blocks
AA=Grown Bad Blocks
AB=Program Fail Count
AC=Erase Fail Count
AD=Average P/E Cycles Attribute
AE=Unexpected Power Loss Count
B2=Used Reserved Block Count
B4=Remaining Reserved Block Count
B8=End to End Error Detection/Correction Count
BB=UECC Count
BC=Command Time Out
C2=Nhiệt độ
C7=SATA CRC Errors
D4=SATA PHY Errors
E6=Media Wearout Indicator
E8=Available Reserved Space
E9=NAND GB Written
EA=NAND GB Written (SLC)
F1=Total Host GB Write
F2=Total GB Read
F3=Throttle Statistics
F4=Thermal Throttle Status

[SmartSanDiskLenovoHelenVenus] ;Added 8.17.0
05=Reassigned Block Count
09=Power On Hours
0C=Drive Số lần bật và tắt nguồn
A6=Minimum P/E Cycles
A7=Maximum Bad Blocks per Die
A8=Maximum P/E cycles
A9=Total Bad Blocks
AA=Grown Bad Blocks
AB=Program Fail Count
AC=Erase Fail Count
AD=Average P/E Cycles Attribute
AE=Unexpected Power Loss Count
B2=Used Reserved Block Count
B4=Remaining Reserved Block Count
B8=End to End Error Detection/Correction Count
BB=UECC Count
BC=Command Time Out
C2=Nhiệt độ
C7=SATA CRC Errors
D4=SATA PHY Errors
E8=Available Reserved Space
E9=Media Wearout Indicator
EA=NAND GB Written (SLC)
F1=Total Host GB Write
F2=Total GB Read
F3=Throttle Statistics
F4=Thermal Throttle Status
F9=NAND GB Written (TLC)

[SmartMicronMU03] ;Added 8.17.0
01=Raw Read Error Rate
05=Reallocated NAND Block Count
09=Power On Hours Count
0C=Số lần bật và tắt nguồn
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Block Erase Count
AE=Unexpected Power Loss Count
B4=Unused Spare NAND Blocks
B5=Non-4K Aligned Access
B7=SATA interface Downshift
B8=Error Correction Count
BB=Số lượng các lỗi không thể sửa
C2=Nhiệt độ
C4=Số lượng các sự kiện remap (thay thế) sectors cho ổ đĩa 
C5=Current Pending ECC Count
C6=SMART Offline Scan Uncorrectable Error Count
C7=UDMA CRC Error Count
CA=Lifetime Remaining
CE=Tỷ lệ lỗi ghi
D2=Successful RAIN Recovery Count
F0=Host Program Page Count
F1=Total LBAs Written
F2=Total LBAs Read
F3=Total Program Page Count
F6=Cumulative Host Sectors Written
F7=Host Program NAND Pages Count
F8=FTL Program NAND Pages Count

[SmartSanDiskCloud] ;Added 9.0.0
05=Retired Block Count
09=Power On Hours
0D=Count of Uncorrectable ECC Errors
20=Write Amplification multiplied by 100
21=Write Amplification Factor
AA=Reserve Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Write/Erase Count
AE=Unexpected Power Loss Count
B2=SSD Life Left (upto 0.01%)
BF=Clean Shutdown Count
C0=Unclean Shutdown Count
C2=Nhiệt độ
C4=Number of Blocks Reallocated
E6=Percent of Total Write/Erase Count
E8=Spare Blocks Remaining
E9=Total Nand Writes 64GB
EB=Capacitor Health
F1=Total Host Writes 64GB
F2=Total Host Reads 64GB
F4=Lifetime Thermal Throttle Activations
F5=Percent Drive Life Remaining
FD=SPI Tests Remaining

[SmartSiliconMotionCVC] ;Added 9.3.0
05=Re-Assigned Count
09=Tổng thời gian hoạt động Count
0C=Drive Số lần bật và tắt nguồn
A5=SLC Cache
AA=Grown Bad Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Avg Erase Count
AE=Unexpected Power Loss Count
AF=Program Fail Count (Worst case)
B7=Total SATA Link Speed Downshift
B8=End-to-End Data Errors corrected
BB=Uncorrectable Errors
BD=Max Erase Count
BE=Nhiệt độ
BF=Min Erase Count
C3=Read Error Rate
C6=Off-Line Scan Số sector không thể sửa
C7=SATA CRC Error Count
CA=SSD Life Left
E8=Total Spare Counts
E9=TLC NAND Write
F1=Host Write
F2=Host Read
94=RAID Event Count
95=RAID Uncorrectable Count
A7=SSD Protect Mode
93=Soft Retry Event Count
EA=SLC NAND Write

[SmartAdataIndustrial] ;Added 9.3.1
09=Tổng thời gian hoạt động
0C=Số lần bật và tắt nguồn Drive
A7=Chế độ bảo vệ SSD
A8=số lần SATA PHY bị lỗi 
A9=Số lượng bad block
AD=Erase Count
AF=Bad Cluster Table Count
B4=Spare block count left
C0=Unexpected Power Loss Count
C2=Nhiệt độ
E7=SSD life left
E9=Flash Write Sector Count
EA=Flash Read Sector Count
F1=Write Sector Count
F2=Read Sector Count
